# Доопрацюйте гру з заняття наступним чином:
#    Додайте вибір слова з будь-якого джерела на ваш вибір
#    Додайте лічильник спроб вгадати слово і вихід з цтклу по переповненню лічильника
#    Додайте більш інформативні повідомлення (список можливих букв для введення, повідомлення про невірне введення, повідомлення про кількість спроб що залишилися і тд)
#    Опційно. Додайте можливість повторювати гру. Запитати в гравця чи хоче він повторити гру Yes/No і повторювати якщо він введе Yes, завершити якщо введе No