# 1. Напишіть функцію, що приймає один аргумент будь-якого типу та повертає цей аргумент, перетворений на float.
#    Якщо перетворити не вдається функція має повернути 0.
# 2. Напишіть функцію, що приймає два аргументи. Функція повинна
#    a. якщо аргументи відносяться до числових типів (int, float) - повернути перемножене значення цих аргументів,
#    b. якщо обидва аргументи це строки (str) - обʼєднати в одну строку та повернути
#    c. у будь-якому іншому випадку повернути кортеж з цих аргументів
# 3. Перепишіть за допомогою функцій вашу программу "Касир в кінотеатрі", яка буде виконувати наступне:
#    a. Попросіть користувача ввести свсвій вік.
#       - якщо користувачу менше 7 - вивести "Тобі ж <> <>! Де твої батьки?"
#       - якщо користувачу менше 16 - вивести "Тобі лише <> <>, а це е фільм для дорослих!"
#       - якщо користувачу більше 65 - вивести "Вам <> <>? Покажіть пенсійне посвідчення!"
#       - якщо вік користувача містить 7 - вивести "Вам <> <>, вам пощастить"
#       - у будь-якому іншому випадку - вивести "Незважаючи на те, що вам <> <>, білетів всеодно нема!"
#    b. Замість <> <> в кожну відповідь підставте значення віку (цифру) та правильну форму слова рік.
#       Для будь-якої відповіді форма слова "рік" має відповідати значенню віку користувача
#       (1 - рік, 22 - роки, 35 - років і тд...).
#       Наприклад:  "Тобі ж 5 років! Де твої батьки?"
#                   "Вам 81 рік? Покажіть пенсійне посвідчення!"
#                   "Незважаючи на те, що вам 42 роки, білетів всеодно нема!"



